# GetAnalyticalSpace Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSurface..::..GetAnalyticalSpace Method
EnergyAnalysisSurface Class See Also
---
Gets the primary analytical space this surface is associated with.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public EnergyAnalysisSpace GetAnalyticalSpace()
```

Visual Basic
---
```text
Public Function GetAnalyticalSpace As EnergyAnalysisSpace
```

Visual C++
---
```text
public:
EnergyAnalysisSpace^ GetAnalyticalSpace()
```

# ### Return Value
The primary analytical space.
# See Also
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace